# Pandas First Steps

## Install

`conda install pandas`

OR

`pip install pandas`

OR 

`!pip install pandas` (Jupyter notebook)

In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: pytz>=2017.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

## Import

`import pandas as pd`

In [2]:
import pandas as pd

In [3]:
data = {
    'apples': [3, 2, 0, 1],
    'oranges': [0, 3, 7, 2]
}

Passing the data to the pandas DataFrame constructor

In [4]:
purchases = pd.DataFrame(data)

purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

Let's have customer names as our indexes:

In [5]:
purchases = pd.DataFrame(data, index=['Olvar', 'Francisco', 'Kevin', 'Ramalakshmi'])

purchases

             apples  oranges
Olvar             3        0
Francisco         2        3
Kevin             0        7
Ramalakshmi       1        2

So now we could **loc**ate a customer's order by using their name

In [6]:
purchases.loc['Kevin']

apples     0
oranges    7
Name: Kevin, dtype: int64

## How to read in data

Here, we'll see how to load data from various file formats into a DataFrame. It's quite simple with pandas.

### Reading data from CSVs

In [13]:
df = pd.read_csv('sample-data/purchases.csv')

df

    Unnamed: 0  apples  oranges
0        Olvar       3        0
1    Francisco       2        3
2        Kevin       0        7
3  Ramalakshmi       1        2

CSVs don't have indexes like our DataFrames, so all we need to do is just designate the `index_col` when reading:

In [14]:
df = pd.read_csv('sample-data/purchases.csv', index_col=0)

df

             apples  oranges
Olvar             3        0
Francisco         2        3
Kevin             0        7
Ramalakshmi       1        2

### Reading data from JSON

If you have a JSON file - which is essentially a stored Python dict - pandas can read a JSON file just as easily:

In [15]:
df = pd.read_json('sample-data/purchases.json')

df

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

Using JSON allows indexes to work through nesting. Pandas will try to figure out how to create a DataFrame by analyzing structure structure of you JSON.

**Note** - Sometimes pandas doesn't get the structure of the DataFrame right. You'll need to set the `orient` keyword argument depending on the structure of your JSON.

In [16]:
df = pd.read_json('sample-data/purchases-per-person.json')

df

         Olvar  Francisco  Kevin  Ramalakshmi
apples       3          2      0            1
oranges      0          3      7            2

In [17]:
df = pd.read_json('sample-data/purchases-per-fruit.json')

df

             apples  oranges
Olvar             3        0
Francisco         2        3
Kevin             0        7
Ramalakshmi       1        2

### Reading data from a SQL database

If you're working with data from a SQL database you need to first establish a connection to the database using an appropriate Python library (connector/driver). Then we'll pass a query to pandas.

In [18]:
%pip install mysql.connector

Collecting mysql.connector
  Downloading mysql-connector-2.2.9.tar.gz (11.9 MB)
Building wheels for collected packages: mysql.connector
  Building wheel for mysql.connector (setup.py): started
  Building wheel for mysql.connector (setup.py): finished with status 'done'
  Created wheel for mysql.connector: filename=mysql_connector-2.2.9-cp38-cp38-win_amd64.whl size=247943 sha256=0a8b83b120395a07463cd2e132301cfac5b201281501b13f729c6a9f17417cec
  Stored in directory: c:\users\akash\appdata\local\pip\cache\wheels\57\e4\98\5feafb5c393dd2540e44b064a6f95832990d543e5b4f53ea8f
Successfully built mysql.connector
Installing collected packages: mysql.connector
Note: you may need to restart the kernel to use updated packages.

ERROR: Could not install packages due to an OSError: [WinError 5] Access is denied: 'c:\\ProgramData\\Anaconda3\\Lib\\site-packages\\mysql\\__init__.py'
Consider using the `--user` option or check the permissions.

In [ ]:
# connect with the database
cnx = ""

In [ ]:
df = pd.read_sql_query("SELECT * FROM employees", cnx)

df

## Converting back to CSV, JSON, or SQL

So, after extensive work on cleaning your data, you're now ready to save it as a file of your choice. Similar tp the ways we read in data, pandas provides intuitive commands to save it:

In [ ]:
df.to_csv('output-data/new_purchases.csv')

df.to_json('output-data/new_purchases.json')

df.to_sql('new_purchases', cnx)

# Most important DataFrame operations

Let's move on to importing some real-world data and detailing a few of the operations you'll be using a lot.

Let's load in the IMDB movies dataset to begin:

In [23]:
movies_df = pd.read_csv("datasets/IMDB-Movie-Data.csv", index_col="Title")

movies_df.head(3)

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0

In [22]:

movies_df.tail(2)

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

In [24]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Genre               1000 non-null   object
 2   Description         1000 non-null   object
 3   Director            1000 non-null   object
 4   Actors              1000 non-null   object
 5   Year                1000 non-null   int64
 6   Runtime (Minutes)   1000 non-null   int64
 7   Rating              1000 non-null   float64
 8   Votes               1000 non-null   int64
 9   Revenue (Millions)  872 non-null    float64
 10  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(4)
memory usage: 93.8+ KB

In [25]:
movies_df.shape

(1000, 11)